RT-Thread/rt-thread/bsp/stm32/libraries/STM32WLxx_HAL/STM32WLxx_HAL_Driver/Inc/stm32wlxx_ll_exti.h
/**
  ******************************************************************************
  * @file    stm32wlxx_ll_exti.h
  * @author  MCD Application Team
  * @brief   Header file of EXTI LL module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics. 
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the 
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32WLxx_LL_EXTI_H
#define __STM32WLxx_LL_EXTI_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32wlxx.h"

/** @addtogroup STM32WLxx_LL_Driver
  * @{
  */

#if defined (EXTI)

/** @defgroup EXTI_LL EXTI
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private Macros ------------------------------------------------------------*/
#if defined(USE_FULL_LL_DRIVER)
/** @defgroup EXTI_LL_Private_Macros EXTI Private Macros
  * @{
  */
/**
  * @}
  */
#endif /*USE_FULL_LL_DRIVER*/
/* Exported types ------------------------------------------------------------*/
#if defined(USE_FULL_LL_DRIVER)
/** @defgroup EXTI_LL_ES_INIT EXTI Exported Init structure
  * @{
  */
typedef struct
{

  uint32_t Line_0_31;           /*!< Specifies the EXTI lines to be enabled or disabled for Lines in range 0 to 31
                                     This parameter can be any combination of @ref EXTI_LL_EC_LINE */

  uint32_t Line_32_63;          /*!< Specifies the EXTI lines to be enabled or disabled for Lines in range 32 to 63
                                     This parameter can be any combination of @ref EXTI_LL_EC_LINE */

  FunctionalState LineCommand;  /*!< Specifies the new state of the selected EXTI lines.
                                     This parameter can be set either to ENABLE or DISABLE */

  uint8_t Mode;                 /*!< Specifies the mode for the EXTI lines.
                                     This parameter can be a value of @ref EXTI_LL_EC_MODE. */

  uint8_t Trigger;              /*!< Specifies the trigger signal active edge for the EXTI lines.
                                     This parameter can be a value of @ref EXTI_LL_EC_TRIGGER. */
} LL_EXTI_InitTypeDef;

/**
  * @}
  */
#endif /*USE_FULL_LL_DRIVER*/

/* Exported constants --------------------------------------------------------*/
/** @defgroup EXTI_LL_Exported_Constants EXTI Exported Constants
  * @{
  */

/** @defgroup EXTI_LL_EC_LINE LINE
  * @{
  */
#define LL_EXTI_LINE_0                  EXTI_IMR1_IM0    /*!< Extended line 0 */
#define LL_EXTI_LINE_1                  EXTI_IMR1_IM1    /*!< Extended line 1 */
#define LL_EXTI_LINE_2                  EXTI_IMR1_IM2    /*!< Extended line 2 */
#define LL_EXTI_LINE_3                  EXTI_IMR1_IM3    /*!< Extended line 3 */
#define LL_EXTI_LINE_4                  EXTI_IMR1_IM4    /*!< Extended line 4 */
#define LL_EXTI_LINE_5                  EXTI_IMR1_IM5    /*!< Extended line 5 */
#define LL_EXTI_LINE_6                  EXTI_IMR1_IM6    /*!< Extended line 6 */
#define LL_EXTI_LINE_7                  EXTI_IMR1_IM7    /*!< Extended line 7 */
#define LL_EXTI_LINE_8                  EXTI_IMR1_IM8    /*!< Extended line 8 */
#define LL_EXTI_LINE_9                  EXTI_IMR1_IM9    /*!< Extended line 9 */
#define LL_EXTI_LINE_10                 EXTI_IMR1_IM10   /*!< Extended line 10 */
#define LL_EXTI_LINE_11                 EXTI_IMR1_IM11   /*!< Extended line 11 */
#define LL_EXTI_LINE_12                 EXTI_IMR1_IM12   /*!< Extended line 12 */
#define LL_EXTI_LINE_13                 EXTI_IMR1_IM13   /*!< Extended line 13 */
#define LL_EXTI_LINE_14                 EXTI_IMR1_IM14   /*!< Extended line 14 */
#define LL_EXTI_LINE_15                 EXTI_IMR1_IM15   /*!< Extended line 15 */
#define LL_EXTI_LINE_16                 EXTI_IMR1_IM16   /*!< Extended line 16 */
#define LL_EXTI_LINE_17                 EXTI_IMR1_IM17   /*!< Extended line 17 */
#define LL_EXTI_LINE_18                 EXTI_IMR1_IM18   /*!< Extended line 18 */
#define LL_EXTI_LINE_19                 EXTI_IMR1_IM19   /*!< Extended line 19 */
#define LL_EXTI_LINE_20                 EXTI_IMR1_IM20   /*!< Extended line 20 */
#define LL_EXTI_LINE_21                 EXTI_IMR1_IM21   /*!< Extended line 21 */
#define LL_EXTI_LINE_22                 EXTI_IMR1_IM22   /*!< Extended line 22 */
#define LL_EXTI_LINE_23                 EXTI_IMR1_IM23   /*!< Extended line 23 */
#define LL_EXTI_LINE_24                 EXTI_IMR1_IM24   /*!< Extended line 24 */
#define LL_EXTI_LINE_25                 EXTI_IMR1_IM25   /*!< Extended line 25 */
#define LL_EXTI_LINE_26                 EXTI_IMR1_IM26   /*!< Extended line 26 */
#define LL_EXTI_LINE_27                 EXTI_IMR1_IM27   /*!< Extended line 27 */
#define LL_EXTI_LINE_28                 EXTI_IMR1_IM28   /*!< Extended line 28 */
#define LL_EXTI_LINE_29                 EXTI_IMR1_IM29   /*!< Extended line 29 */
#define LL_EXTI_LINE_30                 EXTI_IMR1_IM30   /*!< Extended line 30 */
#define LL_EXTI_LINE_31                 EXTI_IMR1_IM31   /*!< Extended line 31 */
#define LL_EXTI_LINE_ALL_0_31           0xFFFFFFFFU      /*!< All Extended line not reserved*/

#define LL_EXTI_LINE_34                 EXTI_IMR2_IM34   /*!< Extended line 34 */
#if defined(DUAL_CORE)
#define LL_EXTI_LINE_36                 EXTI_IMR2_IM36   /*!< Extended line 36 */
#define LL_EXTI_LINE_37                 EXTI_IMR2_IM37   /*!< Extended line 37 */
#endif
#define LL_EXTI_LINE_38                 EXTI_IMR2_IM38   /*!< Extended line 38 */
#if defined(DUAL_CORE)
#define LL_EXTI_LINE_39                 EXTI_IMR2_IM39   /*!< Extended line 39 */
#define LL_EXTI_LINE_40                 EXTI_IMR2_IM40   /*!< Extended line 40 */
#define LL_EXTI_LINE_41                 EXTI_IMR2_IM41   /*!< Extended line 41 */
#endif
#define LL_EXTI_LINE_42                 EXTI_IMR2_IM42   /*!< Extended line 42 */
#define LL_EXTI_LINE_43                 EXTI_IMR2_IM43   /*!< Extended line 43 */
#define LL_EXTI_LINE_44                 EXTI_IMR2_IM44   /*!< Extended line 44 */
#define LL_EXTI_LINE_45                 EXTI_IMR2_IM45   /*!< Extended line 45 */
#define LL_EXTI_LINE_46                 EXTI_IMR2_IM46   /*!< Extended line 46 */
#if defined(DUAL_CORE)
#define LL_EXTI_LINE_ALL_32_63          (EXTI_IMR2_IM34 | EXTI_IMR2_IM36 | EXTI_IMR2_IM37 | \
                                        EXTI_IMR2_IM38 | EXTI_IMR2_IM39 | EXTI_IMR2_IM40 |  \
                                        EXTI_IMR2_IM41 | EXTI_IMR2_IM42 | EXTI_IMR2_IM43 |  \
                                        EXTI_IMR2_IM44 | EXTI_IMR2_IM45 | EXTI_IMR2_IM46) /*!< All Extended line not reserved*/
#else
#define LL_EXTI_LINE_ALL_32_63          (EXTI_IMR2_IM34 | EXTI_IMR2_IM38 | EXTI_IMR2_IM42 | \
                                        EXTI_IMR2_IM43 | EXTI_IMR2_IM44 | EXTI_IMR2_IM45 |  \
                                        EXTI_IMR2_IM46) /*!< All Extended line not reserved*/
#endif

#if defined(USE_FULL_LL_DRIVER)
#define LL_EXTI_LINE_NONE              (0x00000000U)  /*!< None Extended line */
#endif /*USE_FULL_LL_DRIVER*/

/**
  * @}
  */
#if defined(USE_FULL_LL_DRIVER)
/** @defgroup EXTI_LL_EC_MODE Mode
  * @{
  */
#define LL_EXTI_MODE_IT                 ((uint8_t)0x00U) /*!< Interrupt Mode */
#define LL_EXTI_MODE_EVENT              ((uint8_t)0x01U) /*!< Event Mode */
#define LL_EXTI_MODE_IT_EVENT           ((uint8_t)0x02U) /*!< Interrupt & Event Mode */
/**
  * @}
  */

/** @defgroup EXTI_LL_EC_TRIGGER Edge Trigger
  * @{
  */
#define LL_EXTI_TRIGGER_NONE            ((uint8_t)0x00U) /*!< No Trigger Mode */
#define LL_EXTI_TRIGGER_RISING          ((uint8_t)0x01U) /*!< Trigger Rising Mode */
#define LL_EXTI_TRIGGER_FALLING         ((uint8_t)0x02U) /*!< Trigger Falling Mode */
#define LL_EXTI_TRIGGER_RISING_FALLING  ((uint8_t)0x03U) /*!< Trigger Rising & Falling Mode */
/**
  * @}
  */
#endif /*USE_FULL_LL_DRIVER*/

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup EXTI_LL_Exported_Macros EXTI Exported Macros
  * @{
  */

